$(function() {
/*---------------------------------------------------------------------------------------------------------------
                                    功能函数封装
-----------------------------------------------------------------------------------------------------------*/
  var currentPage = 1; //全局变量, 用于传递当前页
  var size = 5; //全局变量 , 用于传递每页的条数

  /**
   * 渲染函数封装
   * 此函数用于渲染一级分类数据
   * 参数 page: 当前页;  size: 每页条数;
   */
  function render(page,size) {
    $.ajax({
      type: "get",
      url: "/category/queryTopCategoryPaging",
      data: {
        page: page,
        pageSize: size
      },
      dataType: "json",
      success: function(info) {
        console.log(info);
        //动态渲染一级分类数据
        var htmlStr = template("tpl", info);
        $(".my-table tbody").html(htmlStr);
      }
    });
  }


/*---------------------------------------------------------------------------------------------------------------
                                    功能函数调用
-----------------------------------------------------------------------------------------------------------*/
//---------进入页面渲染数据
render(currentPage, size);
});