$(function() {
/*-------------------------------------------------------------------------------------------------------------
                                      方法封装
  ----------------------------------------------------------------------------------------------------------- */
  //跟地址栏获取id渲染数据的方法
  function rander() {
    //调用封装的getSearch方法获取id
    var id = getSearch("productId");
    //发送ajax请求
    $.ajax({
      type: "get",
      url: "/product/queryProductDetail",
      data: {
        id: id
      },
      dataType: "json",
      success: function(info) {
        console.log(info);
        var htmlStr = template("tpl", info);
        $(".lt-main .mui-scroll").html(htmlStr);
        //因为轮播图时动态生成的,所以需要手动初始化
        var gallery = mui('.mui-slider');
        gallery.slider({
          interval: 3000 //自动轮播周期，若为0则不自动播放，默认为0；
        });
      }
    });
  }

  
/*-------------------------------------------------------------------------------------------------------------
                                      方法调用
  ----------------------------------------------------------------------------------------------------------- */
  rander();
});